docs/load-test-results/end_of_test_summary_1500rps

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 5000 max VUs, 1m30s max duration (incl. graceful stop):
              * constant_request_rate: 1500.00 iterations/s for 1m0s (maxVUs: 2000-5000, gracefulStop: 30s)


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<300' p(95)=47.61ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 90001  1499.694274/s
    checks_succeeded...................: 99.99% 90000 out of 90001
    checks_failed......................: 0.00%  1 out of 90001

    ✗ status is 200
      ↳  99% — ✓ 90000 / ✗ 1

    HTTP
    http_req_duration.......................................................: avg=9.84ms  min=983.56µs med=4.83ms max=238.61ms p(90)=13.72ms p(95)=47.61ms
      { expected_response:true }............................................: avg=9.84ms  min=983.56µs med=4.83ms max=238.61ms p(90)=13.72ms p(95)=47.61ms
    http_req_failed.........................................................: 0.00% 1 out of 90001
    http_reqs...............................................................: 90001 1499.694274/s

    EXECUTION
    iteration_duration......................................................: avg=10.18ms min=1.03ms   med=4.9ms  max=238.65ms p(90)=13.86ms p(95)=49.04ms
    iterations..............................................................: 90001 1499.694274/s
    vus.....................................................................: 6     min=3          max=266 
    vus_max.................................................................: 2000  min=2000       max=2000

    NETWORK
    data_received...........................................................: 16 MB 259 kB/s
    data_sent...............................................................: 10 MB 173 kB/s



running (1m00.0s), 0000/2000 VUs, 90001 complete and 0 interrupted iterations
constant_request_rate ✓ [ 100% ] 0000/2000 VUs  1m0s  1500.00 iters/s